code/openfoam/tutorials/multiphaseEuler/wallBoilingPolydisperseTwoGroups/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (gas gas2 liquid);

gas
{
    type            purePhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         10;
    }

    residualAlpha   1e-6;
}

gas2
{
    type            purePhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         17;
    }

    residualAlpha   1e-6;
}

liquid
{
    type            purePhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           liquid;
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.00176574;
    }

    gas2_liquid
    {
        $gas_liquid
    }
}

bubbles
{
    continuousPhase liquid;

    sphericalDiameters
    {
        type            exponential;
        min             1e-4;
        max             1.14e-2;
    }

    shapeModel      spherical;

    coalescenceModel
    {
        type            PrinceBlanch;
        turbulence      on;
        buoyancy        on;
        laminarShear    off;
        C1              0.05;
    }

    breakupModel    LehrMilliesMewes;
}

// ************************************************************************* //
